{
    " Mark I": [
        "Superhuman Strength: The armor greatly increased Stark's strength and durability, enabling him to overpower armed terrorists and survive an aerial impact with the ground after escaping. The suit was powered by a small electric motor that is partially exposed at the suit's lower back. The engine powered a pair of external, belt driven mechanisms in the suit's legs that helped support the vast weight of the metal suit. Similar mechanisms in the suit's arms and legs helped Stark to move around while wearing the armor and amplified the strength behind his movements, allowing him to throw punches that could destroy a heavy metal door, knock human enemies back several feet, and partially embedded his arm in a cave wall. Wrapping his hands with tape and the thick welding gloves prevented his hands from breaking on the impact.",
        "Superhuman Durability:      Iron Man withstanding multiple bullets   Multiple layers of durable metal salvaged from missile casings made the armor impervious to medium caliber firearms and reinforced its physical attacks. Because the armor only covered a majority of the vital areas to keep from becoming too cumbersome, Stark wore the thick pants, leather jacket, hand wraps and gloves that he used for welding and molten metalwork, underneath the armor as added protection and insulation against the heat from the suit's flamethrowers.",
        "Superhuman Stamina: The armor allowed Stark, who had been held hostage in a cave for several months, the energy required for his escape from the Ten Rings Base. He was completely undeterred by bullets flying at him and was able to casually walk toward the shooter before pushing him to the side, allowing him to fight through the base without exerting an exorbitant amount of energy. Once he had escaped the base and crash landed in the suit, Stark still had the stamina to begin wandering in the desert and search for help.",
        "Flight: While not capable of sustained flight, the armor was capable of limited flight through single-fire rocket thrusters located on the back of each leg, enabling him to escape during the destruction of the Ten Rings' camp.",
        "Flamethrowers:      Iron Man using his pair of flamethrowers   The armor possesses a flamethrower on each wrist. It is the main method of attacking at medium range.",
        "Missiles: The armor has mounted on each arm missiles along with one single-shot missile concealed in the left arm."
    ],
    " Mark II": [
        "Superhuman Strength: The armor gives its user enhanced strength.",
        "Superhuman Durability: The suit protects its user from getting injured by collisions, acting as an armor for the wearer. Stark crashed through the roof of his house, and landed on one of his cars, but only sustained only minor injuries due to the suit. Furthermore, it was able to protect James Rhodes from a large explosion caused by him and Stark firing their repulsors at each other.",
        "Superhuman Speed: The suit granted its user the ability to move at speeds fast enough to allow for sustained flight. Tony Stark was able to fly out of his garage at high speeds as he took off during his first test of the armor. He was able to fly from Los Angeles to Santa Monica very fast quickly during the test and flew at over 200 miles per hour to get there.",
        "Superhuman Agility: The suit allowed Stark greater control of his body which he would not have if he had to weather the same conditions without the armor. As Stark fell due to an icing problem, he was able to manipulate the suit without worrying about wind resistance. He was also able to do flips during the initial test as he left his garage.",
        "Superhuman Stamina: Using the armor, Stark was able to maintain more energy than he would have survived without the suit. During his first test of the armor, Stark ascended to high altitudes and did not feel the ice surrounding the suit and thinning of the atmosphere as he got higher. Despite the thinning atmosphere, his suit allowed him the stamina to recover as he fell.",
        "Superhuman Reflexes: The armor allowed Stark to react faster than he would have been able to without it. As Stark fell during a failure in his suit due to an icing problem, the suit reactivated soon before Stark hit the ground. Because of the suit, he was able to react at the perfect time to fly along the street without crashing and taking damage."
    ],
    " Mark III": [
        "Superhuman Strength:      Iron Man catching a car   The armor increases the user's strength. It allows Stark to easily break concrete walls with a single punch, throw people single-handedly, and lift cars.",
        "Superhuman Durability: The suit is very durable as the shell is constructed from a gold-titanium alloy which allows it to prevent itself from getting covered in ice like the Mark II armor. It can effectively withstand firearm bullets, tank shells, and a collision with an F-22 Raptor. Stark was hit by a tank while flying at 130 miles per hour and crashed to the ground, but came up unharmed. Despite this, the suit still took damage from bullets and created noticeable bullet holes.",
        "Superhuman Speed: The suit allowed Stark to quickly fly from Los Angeles to Afghanistan. Furthermore, as he was fighting the Ten Rings in Gulmira, Stark was able to quickly navigate the area and move at approximately 130 miles per hour. He was able to surpass the speed of sound while fleeing from two F-22 Raptors.",
        "Superhuman Agility: The suit gave Stark the ability to recover from a strong missile blast throwing off his balance.",
        "Superhuman Stamina: The armor gave Stark the ability to fight terrorists without expending energy. He successfully killed all of the Ten Rings operatives in Gulmira, and did not show fatigue when talking to the group of civilians he had saved. However, this was limited, as by the time he was done in Gulmira, Stark was noticeably out of breath.",
        "Superhuman Reflexes: The suit helped the timing of Stark's reactions. He was able to dodge a tank shell easily, doing so in time to avoid getting hit.",
        "Heads Up Display (HUD): The suit contains a heads-up display within the helmet that can display various metrics and includes a targeting system used during combat situations. The interface is managed by Stark's personal AI, J.A.R.V.I.S. It displays contact information of the person that the suit's wearer is on the phone with, as well as information about the speed the person is flying at relative to the speed of sound. As Stark engaged new features, a display would inform him.",
        "Self-Contained Life-Support System and Environmental Protection: The armor was able to provide life support for its user, even on low power in extreme conditions. Stark used this to his advantage to fly high into the atmosphere, pursued by Obadiah Stane, allowing the life support systems to prevent him from feeling the thinning of the atmosphere.",
        "Cell Service: The user is able to make phone calls in the suit. Much like any other phone call, it can be hard to hear during high noise scenarios such as flight.",
        "Flight:      Iron Man deploying flaps to lose the F-22s   The suit is capable of flight by integrating Stark's proprietary repulsor technology. The repulsors in the palms and the bottom of the boots can produce considerable amounts of thrust. The suit is capable of traveling at supersonic speeds. The gold-titanium alloy construction also makes the suit impervious to icing at high altitudes. According to the suit's HUD after dispatching several terrorists, it was recorded at flying at Mach 0.17% (130.44 miles per hour).",
        "Repulsors: The repulsors on the palms are capable of firing blasts of energy as an offensive measure in addition to providing thrust and stability during flight."
    ],
    " Mark IV": [
        "Superhuman Strength:      Iron Man effortlessly lifting a barbell   To be added",
        "Superhuman Durability: To be added",
        "Superhuman Speed: To be added",
        "Superhuman Agility: To be added",
        "Superhuman Stamina: To be added",
        "Superhuman Reflexes: To be added",
        "Flight: To be added",
        "Heads Up Display (HUD): To be added",
        "Self-Contained Life-Support System and Environmental Protection: To be added",
        "Repulsors:      Iron Man and War Machine blasting against each other   To be added",
        "Unibeam: To be added"
    ],
    " Mark V": [
        "Superhuman Strength: The armor increases the user's strength, to the point where Stark was able to kick a car out of the way, seemingly effortless. While wearing the armor, Stark was also able to easily crush Vanko's arc reactor in one hand."
    ],
    " Mark VI": [
        "Superhuman Strength: The armor increased Stark's strength to where he could push the Helicarrier's rotor blades in order to restart it.",
        "Superhuman Durability: The armor could withstand bullets, lasers, and powerful impact forces without breaking apart.",
        "Superhuman Speed: To be added",
        "Superhuman Agility: To be added",
        "Superhuman Stamina: To be added",
        "Superhuman Reflexes: To be added",
        "Flight: The suit is capable of flying as fast as his previous suits",
        "Heads Up Display (HUD): The Heads-Up display showed important things for the suit. The Heads Up Display of the Iron Man suit was powered by J.A.R.V.I.S., Stark's artificial intelligence. The Suit also had Defensive and Offensive sections, able to switch around the sections, resorting to missiles and lasers. The HUD could also be talked to, and J.A.R.V.I.S. would reply to it. The HUD could scan people, missile identifications, make calls, and give crucial suit credentials such as power. The HUD also had navigational (GPS) support. The suit also had radio capabilities.",
        "Self-Contained Life-Support System and Environmental Protection: The armor could be completely sealed for operations in vacuum or underwater, providing its own life support. It was also shielded against radiation. The armor was shown to be capable of operating underwater, was resistant to water damage, and displayed no sign of faults once submerged underwater. This is the first suit to demonstrate underwater capabilities, remaining watertight at shallow, tidal depths, demonstrated as Stark switched out the electrical system of Stark Tower in the Hudson River."
    ],
    " Mark VII": [
        "Superhuman Strength: To be added",
        "Superhuman Durability: To be added",
        "Superhuman Speed: To be added",
        "Superhuman Agility: To be added",
        "Superhuman Stamina: To be added",
        "Superhuman Reflexes: To be added"
    ],
    " Mark XV": [
        "Iron Man 3\n Iron Man 3: The Junior Novel (alternate universe)\n Iron Man 3: Suits of Armor (concurrent events)",
        "Iron Man 3: The Junior Novel (alternate universe)",
        "Iron Man 3: Suits of Armor (concurrent events)",
        "Iron Man 3 - The Official Game (alternate universe)",
        "The Wakanda Files: A Technological Exploration of the Avengers and Beyond (files)"
    ],
    " Mark XVII": [
        "Iron Man 3\n Lego Iron Man 3 (alternate universe)",
        "Lego Iron Man 3 (alternate universe)",
        "Iron Man 3 - The Official Game (alternate universe)",
        "The Wakanda Files: A Technological Exploration of the Avengers and Beyond (files)"
    ],
    " Mark XXXIII": [
        "Iron Man 3\n LEGO Marvel's Avengers (alternate universe)\n Iron Man 3: The Junior Novel (alternate universe)\n Iron Man 3: Suits of Armor (concurrent events)",
        "LEGO Marvel's Avengers (alternate universe)",
        "Iron Man 3: The Junior Novel (alternate universe)",
        "Iron Man 3: Suits of Armor (concurrent events)",
        "Iron Man 3 - The Official Game (alternate universe)",
        "The Wakanda Files: A Technological Exploration of the Avengers and Beyond (files)"
    ],
    " Mark XXXV": [
        "Iron Man 3\n Iron Man 3: The Junior Novel (alternate universe)\n Iron Man 3: Suits of Armor (concurrent events)",
        "Iron Man 3: The Junior Novel (alternate universe)",
        "Iron Man 3: Suits of Armor (concurrent events)",
        "Iron Man 3 - The Official Game (alternate universe)",
        "Stark Expo: Hong Kong Disneyland (photo; alternate universe)\n Iron Man Experience (photo; alternate universe)",
        "Iron Man Experience (photo; alternate universe)",
        "The Wakanda Files: A Technological Exploration of the Avengers and Beyond (files)"
    ],
    " Mark XXXVIII": [
        "Iron Man 3\n LEGO Marvel's Avengers (alternate universe)\n Iron Man 3: The Junior Novel (alternate universe)\n Iron Man 3: Suits of Armor (concurrent events)",
        "LEGO Marvel's Avengers (alternate universe)",
        "Iron Man 3: The Junior Novel (alternate universe)",
        "Iron Man 3: Suits of Armor (concurrent events)",
        "Iron Man 3 - The Official Game (alternate universe)",
        "The Wakanda Files: A Technological Exploration of the Avengers and Beyond (files)"
    ],
    " Mark XLII": [
        "Superhuman Strength: Even as a prototype, the Mark XLII possessed superhuman strength. During the escape from the Aldrich Killian's Mansion, Tony summoned the glove to punch one henchman in the face, which stunned him, and used a leg part of the armor to kick another armed henchman several feet away. Tony then stomped on one henchman’s foot hard enough to cause him to shoot his gun at his own man before Stark tossed him aside.",
        "Superhuman Durability: The Mark XLII is extremely durable, withstanding many projectile attacks, including those of Extremis Soldiers."
    ],
    " Mark XLIV": [
        "Superhuman Strength: The suit was specifically designed to match the incredible superhuman strength of Hulk (should he ever need to be subdued), and is powered by over eleven Arc Reactors in order to grant the strength required for such a task. The suit was able to hit Hulk in the face hard enough to knock a tooth out, send Hulk flying two streets away with one punch, and ultimately succeeded in knocking Hulk out when the latter started to calm down after seeing the damage caused.",
        "Superhuman Durability: The armor was built to be much stronger than any previous suits, to take more extreme damage, such as Hulk's brutal attacks.",
        "Superhuman Speed: To be added",
        "Superhuman Stamina: To be added",
        "Superhuman Reflexes: To be added",
        "Flight: Like all other armors, the Mark XLIV has flight capabilities, although given its size, its speed and mobility are reduced."
    ],
    " Mark XLV": [
        "Superhuman Strength:     Iron Man saves a falling Lifeboat   The armor amplifies its pilot's strength to superhuman levels, enough for Tony Stark to battle Ultron Sentries with ease, as well as support the weight of a S.H.I.E.L.D. Lifeboat."
    ],
    " Mark XLVI": [
        "Superhuman Strength: The armor amplifies its user's strength to superhuman levels. It allowed Tony Stark to contend with super soldiers, which made him able to grab Bucky Barnes by the neck and lift him off his feet, as well as body slam Captain America back several feet. He was also strong enough to escape from a pile of several automobiles dropped on top of him and topple a giant-sized Ant-Man with the help of War Machine and Spider-Man. It was also able to match and overpower the Winter Soldier's Prosthetic Arm."
    ],
    " Mark XLVII": [
        "Superhuman Strength: The armor amplifies its pilot's strength to superhuman levels. It allowed Stark to push half of a ferry.",
        "Superhuman Durability: To be added",
        "Superhuman Speed: To be added",
        "Superhuman Agility: To be added",
        "Superhuman Stamina: To be added",
        "Superhuman Reflexes: To be added",
        "Flight: Like previous versions of the armor, this one allows for flight via jets in the back, boots, and palm repulsors.",
        "Heads Up Display (HUD): To be added",
        "Self-Contained Life-Support System and Environmental Protection: The armor can be submerged underwater without ill effects.",
        "Armor Summoning: To be added",
        "Collapsible Plating: A design adapted from the Mark V and Mark VII, the armor plating could open and close up from head to toe and allow the user to seamlessly step in and out of the suit at will."
    ],
    " Mark XLVIII": [
        "Superhuman Strength: The suit was built to match the incredible superhuman strength of Hulk. It has several Arc Reactors all over the suit. It was strong enough to kill many Outriders and despite sustaining heavy damage and losing the left arm, was still able to take on Cull Obsidian and eventually overpower him. It was even able to push the Mad Titan Thanos to the ground and deliver a blow to his face, although it should be noted that Thanos was greatly weakened due to the injuries on half of his body and his recently severed left arm."
    ],
    " Mark XLIX": [
        "Superhuman Strength: The armor also increases Potts' strength to the point where she was able to fend off several of Thanos' foot-soldiers during the climactic battle. While not confirmed, it can be assumed that her strength levels with the armor are on par with that of the Mark LXXXV.",
        "Superhuman Durability: Potts' suit of armor is extremely durable as it was able to survive the chaos within the Battle of Earth.",
        "Superhuman Speed: The armor allows Potts to move much faster than the average human.",
        "Superhuman Agility: The suit gave Potts the ability to recover from the Sanctuary II's airstrike.",
        "Superhuman Stamina: To be added",
        "Superhuman Reflexes: Thanks to the HUD inside the armor, the suit, and by extension Pepper Potts, can react to potential threats much quicker than usual.",
        "Flight: The Rescue armor possesses advanced flight capabilities."
    ],
    " Mark L": [
        "Superhuman Strength: The Mark L is much stronger than any of the previous armors. It was strong enough to lift entire chunks of building-sized structures with ease, as it enables him to lift and drop a massive pillar of a building on an unaware Thanos. It was also able to nearly pull off the Infinity Gauntlet from Thanos with aid from Spider-Man, although Thanos was weakened due to Mantis forcing him to sleep. However, the strength of the armor proved to be insufficient to allow Stark to single-handedly combat Thanos. Greater strength can be achieved if it is combined with the nanites generated melee weapons.",
        "Superhuman Durability: The Mark L is much more durable, as it was able to show no signs of damage after experiencing a powerful strike from Cull Obsidian. However, Stark slightly flinched thanks to the attack, and as a result, Spider-Man had to catch a blow from Cull Obsidian using his hammer to prevent Stark from receiving any further damage. It was also able to withstand an entire meteor shower being thrown at it, with minimal damages to its integrity systems. However, the durability of the armor still has limits, as Thanos proved strong enough to punch off pieces of the Mark L's armor with ease."
    ]
}